/***  p03ex03.c  ***/
/***  s12169  2J34  èºîˆóSâ¿  ***/

#include <stdio.h>

int main()
{
	int n1,n2;
    printf("2êîÇì¸óÕ--> ");
    scanf("%d %d",&n1,&n2);
    if (n1>n2) {
        printf("%d > %d\n",n1,n2);
    } else if (n1<n2) {
        printf("%d < %d\n",n1,n2);
    } else {
        printf("%d = %d\n",n1,n2);
    };
	return 0;
}


/**************** é¿çsåãâ  *****************

2êîÇì¸óÕ--> 17 7
17 > 7

2êîÇì¸óÕ--> -17 7
-17 < 7

2êîÇì¸óÕ--> 100 100
100 = 100

*******************************************/
