/***  p01ex09.c  ***/
/***  s12169  2J34  èºîˆóSâ¿  ***/

#include <stdio.h>

int main()
{

    double r,v,s,pai;
    printf("r[cm] = ");
    scanf("%lf",&r);
    
    pai = 3.14159265358979;
    v = 4*pai*r*r*r/3;
    s = 4*pai*r*r;
    
    printf("V[cm] = %7lf\n",v);
    printf("S[cm2] = %7lf\n",s);
    return 0;
}


/**************** é¿çsåãâ  *****************

r[cm] = 0.1
V[cm] = 0.004189
S[cm2] = 0.125664

r[cm] = 0.3
V[cm] = 0.113097
S[cm2] = 1.130973

r[cm] = 1.0
V[cm] = 4.188790
S[cm2] = 12.566371

r[cm] = 3.0
V[cm] = 113.097336
S[cm2] = 113.097336

r[cm] = 10.0
V[cm] = 4188.790205
S[cm2] = 1256.637061

*******************************************/
